app/Views/front-end/v_donasi.php

<?php
$db = \Config\Database::connect();
$web = $db->table('tbl_setting')->get()->getRowArray();
---
SELECT *
FROM `tbl_setting`