app/Models/ModelAdmin.php

SELECT *
FROM `tbl_setting`
WHERE `id` = 1
---
    public function ViewSetting()
    {
        return $this->db->table('tbl_setting')
            ->where('id', 1)
            ->get()->getRowArray();

SELECT *
FROM `tbl_kas_ikt`
WHERE month(tanggal) = '03'
AND year(tanggal) = '2024'
---
    public function AllDataKasIkt()
    {
        return $this->db->table('tbl_kas_ikt')
            ->where('month(tanggal)', date('m'))
            ->where('year(tanggal)', date('Y'))
            ->get()->getResultArray();

SELECT *
FROM `tbl_kas_ibadah`
WHERE month(tanggal) = '03'
AND year(tanggal) = '2024'
---
    public function AllDataKasIbadah()
    {
        return $this->db->table('tbl_kas_ibadah')
            ->where('month(tanggal)', date('m'))
            ->where('year(tanggal)', date('Y'))
            ->get()->getResultArray();

SELECT *
FROM `tbl_kas_ibadah_mingguan`
WHERE month(tanggal) = '03'
AND year(tanggal) = '2024'
---
    public function AllDataKasIm()
    {
        return $this->db->table('tbl_kas_ibadah_mingguan')
            ->where('month(tanggal)', date('m'))
            ->where('year(tanggal)', date('Y'))
            ->get()->getResultArray();