app/Models/ModelKasIbadah.php

SELECT *
FROM `tbl_kas_ibadah`
---
    public function AllData()
    {
        return $this->db->table('tbl_kas_ibadah')
            ->get()->getResultArray();