app/Models/ModelKasIkt.php

    public function AllData()
    {
        return $this->db->table('tbl_kas_ikt')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_kas_ikt`