app/Models/ModelHome.php

SELECT *
FROM `tbl_agenda`
WHERE month(tanggal) = '03'
AND year(tanggal) = '2024'
ORDER BY `tanggal` ASC
---
    public function Agenda()
    {
        return $this->db->table('tbl_agenda')
            ->where('month(tanggal)', date('m'))
            ->where('year(tanggal)', date('Y'))
            ->orderBy('tanggal', 'ASC')
            ->get()->getResultArray();

SELECT *
FROM `tbl_ibadah`
WHERE month(tanggal) = '03'
AND year(tanggal) = '2024'
ORDER BY `tanggal` ASC
---
    public function Ibadah()
    {
        return $this->db->table('tbl_ibadah')
            ->where('month(tanggal)', date('m'))
            ->where('year(tanggal)', date('Y'))
            ->orderBy('tanggal', 'ASC')
            ->get()->getResultArray();

SELECT *
FROM `tbl_kerukunan`
LEFT JOIN `tahun_tbl` ON `tahun_tbl`.`id_tahun` = `tbl_kerukunan`.`id_tahun`
WHERE `tahun` = '2024'
---
    public function AllDataKerukunan()
    {
        return $this->db->table('tbl_kerukunan')
            ->join('tahun_tbl', 'tahun_tbl.id_tahun = tbl_kerukunan.id_tahun', 'left')
            ->where('tahun', date('Y'))
            ->get()->getResultArray();

SELECT *
FROM `tbl_wilayah`
LEFT JOIN `tahun_tbl` ON `tahun_tbl`.`id_tahun` = `tbl_wilayah`.`id_tahun`
WHERE `tahun` = '2024'
---
    public function AllDataWilayah()
    {
        return $this->db->table('tbl_wilayah')
            ->join('tahun_tbl', 'tahun_tbl.id_tahun = tbl_wilayah.id_tahun', 'left')
            ->where('tahun', date('Y'))
            ->get()->getResultArray();

INSERT INTO `tbl_donasi2` (`nama_pengirim`, `no_telp`, `jenis_donasi`, `jumlah_donasi`) VALUES ('das', '1234', 'Rumah Tongkonan', '20000')
---
    public function InsertDonasi2($data)
    {
        $this->db->table('tbl_donasi2')->insert($data);