app/Views/v_home.php

<?php
$db = \Config\Database::connect();
$web = $db->table('tbl_setting')->get()->getRowArray();
---
SELECT *
FROM `tbl_setting`